print("닭을 세어봅시다")   # 글씨 출력

print("암탉", 25 + 30 / 6)    # = 25 + 5 = 30
print("수탉", 100 - 25 * 3 % 4) # = 100 - 75 % 4 = 100 - 3 = 97

print("이제 달걀도 세어봅시다.") # 글씨 출력

print(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6) # = 3 + 2 + 1 - 5 + 0 - 0.25 + 6 = 0.75 + 6

print("3 + 2 < 5 - 7 는 참인가요?") # 글씨 출력

print(3 + 2 < 5 - 7) # = 5 < -2 = False

print("3 + 2는 얼마죠?", 3 + 2) # 텍스트를 출력하고 계산 결과를 출력
print("5 - 7은 얼마죠?", 5 - 7) # 텍스트를 출력하고 계산 결과를 출력

print("아하 이게 False인 이유네요") # 텍스트를 출력

print("더 해볼까요.") # 텍스트를 출력

print("더 큰가요?", 5 > -2) # = True
print("더 크거나 같나요?", 5 >= -2) # = True
print("더 작거나 같나요?", 5 <= -2) # = False
